app/controllers/meal_plans_controller.rb

SELECT "meal_plans".* FROM "meal_plans"
---
  def index
    @meal_plans = MealPlan.all

SELECT "meal_plans".* FROM "meal_plans" WHERE "meal_plans"."id" = 1 LIMIT 1
---
  def show
    # Encontra o plano de alimentação pelo ID.
    # Usamos includes para carregar as associações necessárias e evitar problemas de N+1 queries.
    @meal_plan = MealPlan.includes(meals: [:recipes, { meal_ingredients: :ingredient }]).find(params[:id])

INSERT INTO "meal_plans" ("start_date", "end_date", "user_id", "created_at", "updated_at") VALUES ('2025-06-03', '2025-12-23', 3, '2025-03-24 21:40:30.110631', '2025-03-24 21:40:30.110631') RETURNING "id"
---
  def create
    @meal_plan = MealPlan.new(meal_plan_params)

    respond_to do |format|
      if @meal_plan.save