app/controllers/meals_controller.rb

SELECT "meals".* FROM "meals"
---
  def index
    # Busca as refeições do usuário logado para a data selecionada
    # Inclui meal_ingredients e ingredients para evitar N+1 queries
    @meals = current_user.meals.where(date: @date).includes(meal_ingredients: :ingredient).order(:meal_type)

    # Calcula o total de calorias para o dia
    @total_calories = @meals.sum do |meal|

SELECT "meals".* FROM "meals" WHERE "meals"."id" = 1 LIMIT 1
---
  def show
    @meal = current_user.meals.find(params[:id])

INSERT INTO "meals" ("name", "date", "user_id", "created_at", "updated_at") VALUES ('Almoço', '2024-05-02', 2, '2025-03-12 16:52:44.565858', '2025-03-12 16:52:44.565858') RETURNING "id"
---
  def create
    @meal = current_user.meals.new(meal_params)
    @meal.user = current_user # Garante associação correta com o usuário

    if @meal.save

SELECT "meals".* FROM "meals" WHERE "meals"."id" = 1 LIMIT 1
---
    def set_meal
      @meal = Meal.find(params.expect(:id))