app/controllers/sessions_controller.rb

  def create
    # Busca o usuário pelo email (ignora maiúsculas/minúsculas)
    user = User.find_by(email: params[:session][:email].downcase)
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'claudio_zeppeli@hotmail.com' LIMIT 1