app/controllers/users_controller.rb

  def create
    # Cria uma nova instância de User com os dados permitidos
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password") VALUES (NULL, 'Claudio_zeppeli@hotmail.com', '2025-04-24 17:52:46.237809', '2025-04-24 17:52:46.237809', 'm6vrh83MpCntnfS') RETURNING "id"